Hello, I tried with v1.2.7 and v1.2.8 today. I'm able to import VXCs successfully but there are a number of changes/modifications everytime that terraform runs after the resource is imported.
  # megaport_vxc.pub_gcp_vxc_1 will be updated in-place
  ~ resource "megaport_vxc" "pub_gcp_vxc_1" {
      ~ a_end                = {
          ~ current_product_uid   = "REDACTED" -> (known after apply)
          ~ location              = "Equinix SG1" -> (known after apply)
          ~ location_id           = 36 -> (known after apply)
          ~ product_name          = "mcr-01" -> (known after apply)
          ~ vlan                  = 336 -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "REDACTED" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix SG1" -> (known after apply)
          ~ location_id           = 36 -> (known after apply)
          ~ product_name          = "Singapore (sin-zone2-2260)" -> (known after apply)
          ~ vlan                  = 2793 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Saturday, 29-Jun-24 14:00:00 UTC" -> (known after apply)
      ~ contract_start_date  = "Thursday, 30-May-24 14:38:35 UTC" -> (known after apply)
      ~ create_date          = "Thursday, 30-May-24 14:34:03 UTC" -> (known after apply)
      ~ last_updated         = "Thursday, 30-Jan-25 15:26:55 UTC" -> (known after apply)
      ~ live_date            = "Thursday, 30-May-24 14:38:35 UTC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)